
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОграничениеНаКоличествоИсполнителей = мзЗадания.ПолучитьОграничениеНаКоличествоИсполнителей();
	ГлубинаХраненияИстории = мзЗадания.ПолучитьГлубинуХраненияИстории();
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.мзМенеджерЗаданий);
	АктивныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	МенеджерЗапущен = АктивныеРегламентныеЗадания.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьМенеджераЗаданий(Команда)
	мзЗадания.ЗапуститьМенеджераЗаданий();
	МенеджерЗапущен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьМенеджераЗаданийИИсполнителей(Команда)
	мзЗадания.ОстановитьМенеджераЗаданий();
	мзЗадания.ОстановитьАктивныхИсполнителей();
	
	МенеджерЗапущен = Ложь;
	ОбновитьДанныеПоИсполнителямИЗаданиям();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоИсполнителямИЗаданиям()
	КоличествоАктивныхИсполнителей = мзЗадания.ПолучитьКоличествоАктивныхИсполнителей();
	КоличествоЗаданийВОчереди = мзЗадания.ПолучитьКоличесвоЗаданийВОчереди();
	ВсегоАктивныхЗаданий = КоличествоАктивныхИсполнителей + КоличествоЗаданийВОчереди;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеЗаданияВОчереди(Команда)
	мзЗадания.ОтменитьВсеЗаданияВОчереди();
	ОбновитьДанныеПоИсполнителямИЗаданиям();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОграничениеПоКоличествуИсполнителей(Команда)
	мзЗадания.УстановитьОграничениеПоКоличествуИсполнителей(ОграничениеНаКоличествоИсполнителей);
КонецПроцедуры

&НаКлиенте
Процедура ПринудительноОбновитьДанныеПоИсполнителямИЗаданиям(Команда)
	ОбновитьДанныеПоИсполнителямИЗаданиям();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьГлубинуХраненияИстории(Команда)
	мзЗадания.УстановитьГлубинуХраненияИстории(ГлубинаХраненияИстории);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеПоИсполнителямИЗаданиям();
	ПодключитьОбработчикОжидания("ОбновитьДанныеПоИсполнителямИЗаданиям", 60);
КонецПроцедуры
